// Cтворюю об'єкт з трьома властивостями 
const myObject = {
    name: "Anna",
    age: 35,
    city: "Napoli",
    // Далі беру метод getInfo(), який виводитб всі властивості об'єкта у вигляді пар "ключ: значення"
    getInfo: function() {
        // Створюю порожній рядок для зберігання інформації про властивості
        let info = "";

        // Йду по кожній властивості об'єкта
        for (let key in this) {
            // Перевіряю чи властивість належить самому об'єкту (не прототипу)
            if (this.hasOwnProperty(key)) {
                // Далі додаю пару "ключ: значення" до рядка info
                info += `${key}: ${this[key]}\n`;
            }
        }

        // Виводим інформацію через консоль
        console.log(info);
    }
};

// Вся інфа про об'єкт
myObject.getInfo();

// Додаю нову властивість
myObject.newProperty = 'Нова властивість!';

// Виводімо оновлену інформацію про об'єкт
myObject.getInfo();
